Revit 2027 API
MEPAnalyticalSegment.SetComments Method
 Sets the comments for this analytical segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetComments(
	MEPAnalyticalModelData analyticalModel,
	string newComments
)
Public Sub SetComments (
	analyticalModel As MEPAnalyticalModelData,
	newComments As String
)
public:
void SetComments(
	MEPAnalyticalModelData^ analyticalModel,
	String^ newComments
)
member SetComments :
        analyticalModel : MEPAnalyticalModelData *
        newComments : string -> unit
Parameters
analyticalModel MEPAnalyticalModelData
 The analytical model data that this segment belongs to.
newComments String
 The new comments.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace